УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f008b09-45f5-46c4-8328-e52829147381">
  <name>Проекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="24d508af-8d0e-4daf-a6d7-9b40c1eb36b3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7d468fba-e35f-4187-8bf3-1ad16042cd5c">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ef5bce5-04ec-4290-b75b-342df3e7a74d">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30f6b359-a769-437e-975f-fa4f2e92e3fd">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0edeaa09-7e78-498e-9c54-ce2f2a69f969">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4b58d5ae-eed2-4e62-a1be-0eba4ff92bcd">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff79f803-60df-471d-924b-b81d7553efb1">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17c62a5c-9d9e-4169-8fa7-26e1f27c5163">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормыЭлементов

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаНачала = ТекущаяДата();
		Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 6);
		ПроверитьДатуОкончания();
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 6);
		ПроверитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартДатаОкончанияПриИзменении(Элемент)
	
	ПроверитьДатуОкончания();
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартПартнерыИКонтактныеЛицаПартнерПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ТекущиеДанные = Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда			
			Объект.Наименование = ТекущиеДанные.Партнер;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

#КонецОбласти

#Область ПрочиеПроцедурыФункции

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()
	
	// Добавление поля Родитель (Направление) на форму
	ЭлементРодитель = Элементы.Вставить("смартРодитель", Тип("ПолеФормы"),, Элементы.ГруппаСтраницы);
	ЭлементРодитель.ПутьКДанным = "Объект.Родитель";
	ЭлементРодитель.Заголовок 	= "Направление";
	ЭлементРодитель.Вид = ВидПоляФормы.ПолеВвода;
	
	// Добавление обработчика события стандартным элементам
	Элементы.ДатаНачала.УстановитьДействие("ПриИзменении", "смартДатаНачалаПриИзменении");
	Элементы.ДатаОкончания.УстановитьДействие("ПриИзменении", "смартДатаОкончанияПриИзменении");
	Элементы.ПартнерыИКонтактныеЛицаПартнер.УстановитьДействие("ПриИзменении", "смартПартнерыИКонтактныеЛицаПартнерПриИзменении");
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура ПроверитьДатуОкончания()
	
	МаксимальнаяДатаОкончания = ДобавитьМесяц(ТекущаяДата(), 6);
	
	Если Объект.ДатаОкончания > МаксимальнаяДатаОкончания Тогда
		Объект.ДатаОкончания = МаксимальнаяДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

#КонецОбласти
